# `read_csv()` - `usecols` parameter

Load a dataset with specific column(s)

In [2]:
import pandas as pd

## 1. Using column names

In [3]:
df_students = pd.read_csv("./datasets/students_score_no_index.csv", usecols=["Name", "Score"])

df_students

       Name  Score
0      Paul     98
1     Aaron     89
2    Krista     99
3  Veronica     87
4    Paxton     90
5   Madison     83
6    Aurora     82

## 2. Using column index

In [4]:
df_students = pd.read_csv("./datasets/students_score_no_index.csv", usecols=[0, 1])

df_students

       Name  Score
0      Paul     98
1     Aaron     89
2    Krista     99
3  Veronica     87
4    Paxton     90
5   Madison     83
6    Aurora     82

## 3. Using column names as a list

In [6]:
# Create a list of column names
column_names = ['Name', 'Score']

In [8]:
df_students = pd.read_csv("./datasets/students_score_no_index.csv", usecols=column_names)

df_students

       Name  Score
0      Paul     98
1     Aaron     89
2    Krista     99
3  Veronica     87
4    Paxton     90
5   Madison     83
6    Aurora     82

## 4. Use col_labels

In [64]:
df_students_full = pd.read_csv("./datasets/students.csv")

df_students_full

   Id First Name    Last Name  Score Grades         City State     State Name
0   1       Paul   Rochemback     98     AA       Austin    TX          Texas
1   2      Aaron        Souls     89     AB       Albany    NY       New York
2   3     Krista      Svenson     99     AA    Nashville    TN      Tennessee
3   4   Veronica     Albridge     87     AB       Boston    MA  Massachusetts
4   5     Paxton      Samuels     90     AC    Knoxville    TN      Tennessee
5   6    Madison  Caracullian     83     BA  Kansas City    MO       Missouri
6   7     Aurora      Jardern     82     BB       Toledo    OH           Ohio

In [66]:
df_students_full_2 = pd.read_csv("./datasets/students.csv", usecols=lambda x: x.upper() in ['City', 'State', 'State Name'])

df_students_full_2

Empty DataFrame
Columns: []
Index: []